Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH01/atdf/PIC32CM2532JH01048.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA08"/>
              <signal group="PAD" index="0" function="C" pad="PA12"/>
              <signal group="PAD" index="1" function="D" pad="PA09"/>
              <signal group="PAD" index="1" function="C" pad="PA13"/>
              <signal group="PAD" index="2" function="D" pad="PA10"/>
              <signal group="PAD" index="2" function="C" pad="PA14"/>
              <signal group="PAD" index="3" function="D" pad="PA11"/>
              <signal group="PAD" index="3" function="C" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="6" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="7" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="20"/>
              <param name="GCLK_ID_SLOW" value="17"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="67" caption="Instance index for SERCOM2"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA16"/>
              <signal group="PAD" index="0" function="C" pad="PA22"/>
              <signal group="PAD" index="1" function="D" pad="PA17"/>
              <signal group="PAD" index="1" function="C" pad="PA23"/>
              <signal group="PAD" index="2" function="D" pad="PA18"/>
              <signal group="PAD" index="2" function="D" pad="PA20"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="3" function="D" pad="PA19"/>
              <signal group="PAD" index="3" function="D" pad="PA21"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="8" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="9" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="21"/>
              <param name="GCLK_ID_SLOW" value="17"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="68" caption="Instance index for SERCOM3"/>
            </parameters>
          </instance>
          <instance name="SERCOM4">
            <register-group name="SERCOM4" name-in-module="SERCOM" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA12"/>
              <signal group="PAD" index="0" function="D" pad="PB08"/>
              <signal group="PAD" index="1" function="D" pad="PA13"/>
              <signal group="PAD" index="1" function="D" pad="PB09"/>
              <signal group="PAD" index="2" function="D" pad="PA14"/>
              <signal group="PAD" index="2" function="D" pad="PB10"/>
              <signal group="PAD" index="3" function="D" pad="PA15"/>
              <signal group="PAD" index="3" function="D" pad="PB11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="10" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="11" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="22"/>
              <param name="GCLK_ID_SLOW" value="17"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="69" caption="Instance index for SERCOM4"/>
            </parameters>
          </instance>
          <instance name="SERCOM5">
            <register-group name="SERCOM5" name-in-module="SERCOM" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA22"/>
              <signal group="PAD" index="0" function="D" pad="PB02"/>
              <signal group="PAD" index="1" function="D" pad="PA23"/>
              <signal group="PAD" index="1" function="D" pad="PB03"/>
              <signal group="PAD" index="2" function="D" pad="PA24"/>
              <signal group="PAD" index="2" function="D" pad="PB22"/>
              <signal group="PAD" index="2" function="C" pad="PA20"/>
              <signal group="PAD" index="3" function="D" pad="PA25"/>
              <signal group="PAD" index="3" function="D" pad="PB23"/>
              <signal group="PAD" index="3" function="C" pad="PA21"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="12" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="13" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="23"/>
              <param name="GCLK_ID_SLOW" value="17"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="70" caption="Instance index for SERCOM5"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="U2117" version="2.1.1">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001800"/>
            <parameters>
              <param name="BODCORE_CALIB_MSB" value="5"/>
              <param name="BODVDD_CALIB_MSB" value="5"/>
              <param name="SUPC_OUT_NUM_MSB" value="1" caption="MSB of backup output pad Number"/>
              <param name="INSTANCE_ID" value="6" caption="Instance index for SUPC"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
