Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH01/atdf/PIC32CM2532JH01048.atdf
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="COMP2" caption="Comparator 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="COMP3" caption="Comparator 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="WIN1" caption="Window 1 Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="COMP0" caption="Comparator 0" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1" mask="0x2"/>
          <bitfield name="COMP2" caption="Comparator 2" mask="0x4"/>
          <bitfield name="COMP3" caption="Comparator 3" mask="0x8"/>
          <bitfield name="WIN0" caption="Window 0" mask="0x10"/>
          <bitfield name="WIN1" caption="Window 1" mask="0x20"/>
        </register>
        <register name="STATUSA" offset="0x7" rw="R" size="1" initval="0x00" caption="Status A">
          <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1"/>
          <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2"/>
          <bitfield name="STATE2" caption="Comparator 2 Current State" mask="0x4"/>
          <bitfield name="STATE3" caption="Comparator 3 Current State" mask="0x8"/>
          <bitfield name="WSTATE0" caption="Window 0 Current State" mask="0x30" values="AC_STATUSA__WSTATE0"/>
          <bitfield name="WSTATE1" caption="Window 1 Current State" mask="0xC0" values="AC_STATUSA__WSTATE1"/>
        </register>
        <register name="STATUSB" offset="0x8" rw="R" size="1" initval="0x00" caption="Status B">
          <bitfield name="READY0" caption="Comparator 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="Comparator 1 Ready" mask="0x2"/>
          <bitfield name="READY2" caption="Comparator 2 Ready" mask="0x4"/>
          <bitfield name="READY3" caption="Comparator 3 Ready" mask="0x8"/>
        </register>
        <register name="DBGCTRL" offset="0x9" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="WINCTRL" offset="0xA" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Window Control">
          <bitfield name="WEN0" caption="Window 0 Mode Enable" mask="0x1"/>
          <bitfield name="WINTSEL0" caption="Window 0 Interrupt Selection" mask="0x6" values="AC_WINCTRL__WINTSEL0"/>
          <bitfield name="WEN1" caption="Window 1 Mode Enable" mask="0x10"/>
          <bitfield name="WINTSEL1" caption="Window 1 Interrupt Selection" mask="0x60" values="AC_WINCTRL__WINTSEL1"/>
        </register>
        <register name="SCALER" offset="0xC" rw="RW" size="1" count="4" initval="0x00" caption="Scaler n">
          <bitfield name="VALUE" caption="Scaler Value" mask="0x3F"/>
        </register>
        <register name="COMPCTRL" offset="0x10" rw="RW" access="WSYNC" size="4" count="4" initval="0x00000000" caption="Comparator Control n">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="SINGLE" caption="Single-Shot Mode" mask="0x4"/>
          <bitfield name="INTSEL" caption="Interrupt Selection" mask="0x18" values="AC_COMPCTRL__INTSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="MUXNEG" caption="Negative Input Mux Selection" mask="0x700" values="AC_COMPCTRL__MUXNEG"/>
          <bitfield name="MUXPOS" caption="Positive Input Mux Selection" mask="0x7000" values="AC_COMPCTRL__MUXPOS"/>
          <bitfield name="SWAP" caption="Swap Inputs and Invert" mask="0x8000"/>
          <bitfield name="SPEED" caption="Speed Selection" mask="0x30000" values="AC_COMPCTRL__SPEED"/>
          <bitfield name="HYSTEN" caption="Hysteresis Enable" mask="0x80000"/>
          <bitfield name="FLEN" caption="Filter Length" mask="0x7000000" values="AC_COMPCTRL__FLEN"/>
          <bitfield name="OUT" caption="Output" mask="0x30000000" values="AC_COMPCTRL__OUT"/>
        </register>
        <register name="SYNCBUSY" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="WINCTRL" caption="WINCTRL Synchronization Busy" mask="0x4"/>
          <bitfield name="COMPCTRL0" caption="COMPCTRL 0 Synchronization Busy" mask="0x8"/>
          <bitfield name="COMPCTRL1" caption="COMPCTRL 1 Synchronization Busy" mask="0x10"/>
          <bitfield name="COMPCTRL2" caption="COMPCTRL 2 Synchronization Busy" mask="0x20"/>
          <bitfield name="COMPCTRL3" caption="COMPCTRL 3 Synchronization Busy" mask="0x40"/>
        </register>
      </register-group>
      <value-group name="AC_STATUSA__WSTATE0">
        <value name="ABOVE" caption="Signal is above window" value="0"/>
        <value name="INSIDE" caption="Signal is inside window" value="1"/>
        <value name="BELOW" caption="Signal is below window" value="2"/>
      </value-group>
      <value-group name="AC_STATUSA__WSTATE1">
        <value name="ABOVE" caption="Signal is above window" value="0"/>
        <value name="INSIDE" caption="Signal is inside window" value="1"/>
        <value name="BELOW" caption="Signal is below window" value="2"/>
      </value-group>
      <value-group name="AC_WINCTRL__WINTSEL0">
        <value name="ABOVE" caption="Interrupt on signal above window" value="0"/>
        <value name="INSIDE" caption="Interrupt on signal inside window" value="1"/>
        <value name="BELOW" caption="Interrupt on signal below window" value="2"/>
        <value name="OUTSIDE" caption="Interrupt on signal outside window" value="3"/>
      </value-group>
      <value-group name="AC_WINCTRL__WINTSEL1">
        <value name="ABOVE" caption="Interrupt on signal above window" value="0"/>
        <value name="INSIDE" caption="Interrupt on signal inside window" value="1"/>
        <value name="BELOW" caption="Interrupt on signal below window" value="2"/>
        <value name="OUTSIDE" caption="Interrupt on signal outside window" value="3"/>
      </value-group>
